import React, {Component} from 'react';

export default class Applicants extends Component {
    render() {
        return (
            <div className="about">
                <div className="content">
                    <h2>
                        <span className='underline'>
                            Абітурієнтам
                        </span>
                    </h2>
                    <p>Кафедра прикладних інформаційних систем запрошує на навчання абітурієнтів на навчальну програму «Прикладне програмування » спеціальності 122 «Комп'ютерні науки»</p>
                    <p>Програма подвійних дипломів: вища школа бізнеса в Домброві (ПОЛЬША) та комп'ютерна школа ЛІДС (ВЕЛИКОБРИТАНИЯ) (факультети информатики, менеджмента)</p>
                    <p><em>Термін навчання: денна - 4 роки та інші.</em></p>

                    <h2>
                        <span className='underline'>
                            Наші пріоритети
                        </span>
                    </h2>

                    <ul>
                        <li>Забезпечення іногородніх студентів першого курсам місцями в гуртожитках, з доступом до мережі Internet, WI-FI.</li>
                        <li>Забезпечення 45% рейтинга студентів першого курсу бюджетної форми навчання стипендією</li>
                        <li>Постійне проведення спільних науково - практичних конференцій, виконання студентських проектів, організація «круглих столів», семінарів, олімпіад серед студентської молоді.</li>
                        <li>Розвинена система спортивних секцій з багатьох видів спорту. Діють спортзал, стадіон, спортивний майданчик; можливість увійти до складу збірних команд університету.</li>
                    </ul>


                    <h2>
                        <span className='underline'>
                            Прийом документів
                        </span>
                    </h2>

                    <ul>
                        <li className='list-title'>До заяви абітурієнт приносить:</li>
                        <li>Документ про повну загальну середню освіту (оригінал або його завірену копію);</li>
                        <li>Сертифікат з трьох предметів: українська мова та література, математика, фізика або іноземна мова за вибором;</li>
                        <li>Медичну довідку за формою 086-У;</li>
                        <li>6 кольорових фото розміром 3х4 см;</li>
                        <li>Копію довідки про присвоєння ідентифікаційного коду, три поштових конверти з марками, папку-обкладинку, конверти форматів А4, А5;</li>
                        <li>Паспорт, військовий квиток або посвідчення про приписку до призовної дільниці та документи, що дають право на пільги, вступник пред'являє особисто в терміни, визначені для подання документів</li>
                    </ul>

                    <h2>
                        <span className='underline'>
                            За додатковою інформацією - зв'яжіться з нами!
                        </span>
                    </h2>

                </div>
            </div>
        )
    }
}