import React, {Component} from 'react';
import standart_src from '../../difSrc/122.docx';
import dip_src from '../../difSrc/diplomnie_rabotu.pdf';

export default class Content extends Component {
    download(url) {
        const a = document.getElementById('download_smth');
        a.href = url;
        a.download = url;
        a.dispatchEvent(new MouseEvent('click'));
    };
    render() {
        return (
            <div className="content">
                <h2>
                    <span className='underline'>
                        Загалом
                    </span>
                </h2>
                <div className="content-box">
                    <h3>Кафедра прикладних інформаційних систем</h3>
                    <p>Кафедра прикладних інформаційних систем заснована у червні місяці 2016 року. На кафедрі працюють висококваліфіковані викладачі, які мають значний педагогічний і практичний комерційний досвід у розробленні та застосуванні сучасних інформаційних технологій. Прикладні системи – це програмні засоби, призначені для розв’язання прикладних задач та орієнтовані на автоматизацію конкретних видів економічної або іншої діяльності.</p>
                </div>


                <h2>
                    <span className='underline'>
                        Детальнiше
                    </span>
                </h2>

                <div className="content-box">
                    <h3>Прикладні інформаційні системи</h3>
                    <p>Прикладні інформаційні системи – це перспективний напрям навчання і діяльності, адже зачіпає питання впровадження інновацій у різні види діяльності. Це трансдисциплінарна наука, що об’єднує різноманітні сектори та напрями діяльності і галузей знань. Прикладні інформаційні системи є тим двигуном, без якого практично неможливо розв’язати задачі прикладних сфер, як-от, ІТ в агросекторі, електроенергетиці, машинобудуванні, фінансах і банківській діяльності тощо. Наприклад, економіка зараз трансформується у цифрову, форма організації праці у мережеву, а підприємства стають віртуальними. Нині неможливо уявити роботу фахівця галузі інформаційних технологій без комп’ютера, мережі, інформаційної системи.</p>
                    <p>Адже практично кожну прикладну задачу виконують за допомогою певних програмних продуктів: 1С, Галактика, Парус, Audit Expert, Risky Project, Master MRP та інші. Студенти впродовж навчання отримують фундаментальні знання у сфері аналітики, розроблення і впровадження застосунків у сфері економіки і фінансів, медицини, освіти, науки тощо.</p>
                </div>


                <h2>
                    <span className='underline'>
                        Що ти вивчиш
                    </span>
                </h2>

                <div className="content-box">
                    <h3>Наші викладачі навчать</h3>
                    <ul>
                        <li>Застосовувати методи та програмні засоби оптимізації для розв’язання прикладних задач</li>
                        <li>розробляти системи підтримки прийняття рішень</li>
                        <li>розв’язувати задачі прогнозування і моделювання процесів різних прикладних сфер і здійснювати їх системний аналіз</li>
                        <li>розробляти бази (сховища) даних або знань, обирати їх системи керування</li>
                        <li>розробляти математичні модельні рішення складних процесів</li>
                        <li>розробляти і впроваджувати прикладні інформаційні системи з використанням новітніх ІКТ на основі проектного менеджменту тощо.</li>
                    </ul>
                    <p>Фахівці з прикладних інформаційних систем покликані реалізовувати всі етапи створення програмного забезпечення для замовника: визначення та аналізу вимог замовника, проектування архітектури програмної системи, детального проектування, конструювання, комплексування програмних засобів, їх тестування, інсталяції, підтримання, супроводження, а також сприяти своєчасній заміні/виведенню програмних засобів з експлуатації.</p>
                </div>


                <h2>
                    <span className='underline'>
                        Реалiзацiя
                    </span>
                </h2>

                <div className="content-box">

                    <h3>Наші викладачі навчать</h3>
                    <ul>
                        <li className='list-title'>У сфері математичної підготовки:</li>
                        <li>Дискретна математика.</li>
                        <li>Основи математичної логіки.</li>
                        <li>Методи обчислень.</li>
                        <li>Графи та дерева.</li>
                        <li>Теорія ймовірностей.</li>
                        <li>Алгебраїчні структури.</li>
                        <li>Чисельні методи.</li>
                        <li>Методи оптимізації.</li>
                        <li>Дослідження операцій.</li>
                        <li>Математичне моделювання тощо.</li>

                        <li className='list-title'>У сфері програмування:</li>
                        <li>Алгоритми і структури даних.</li>
                        <li>Основи програмування.</li>
                        <li>Об’єктно-орієнтоване програмування.</li>
                        <li>Паралельні та розподілені обчислення тощо.</li>
                        
                        <li className="list-title">У сфері технологій і процесів розроблення програмного забезпечення:</li>
                        <li>Методології розроблення та супроводження програмного забезпечення.</li>
                        <li>Аналіз вимог до ПЗ.</li>
                        <li>Проектування архітектури.</li>
                        <li>Розроблення веб-застосунків.</li>
                        <li>Розроблення сервіс-орієнтованих та клієнт-серверних застосунків.</li>
                        <li>Тестування програмного забезпечення.</li>
                        <li>Сучасні методології розробки.</li>

                        <li className="list-title">У сфері технічної підготовки:</li>
                        <li>Архітектура, будова та функціонування обчислювальних систем.</li>
                        <li>Основи сучасних операційних систем.</li>
                    </ul>
                    <p>Професійна діяльність випускників пов’язана з індустрією інформаційних технологій та розробленням, упровадженням і супроводженням конкурентоздатного прикладного програмного забезпечення у сферах</p>

                    <ul className={`big-ul`}>
                        <li>
                            <span className="mini-logo">Економіки</span>
                            У загальному вигляді інформаційні технології в економіці визначають як сукупність дій над економічною інформацією для прийняття оптимальних ефективних рішень.
                        </li>

                        <li>
                            <span className="mini-logo">Видавництва</span>
                            Для підприємств видавничо-поліграфічної галузі є важливим застосування інформаційних технологій для підвищення ефективності процесів підготовлення та виготовлення поліграфічної продукції, організації документообігу, адміністрування та поширення видань.
                        </li>

                        <li>
                            <span className="mini-logo">Юриспруденції</span>
                            Розробники займаються розробленням і супроводженням спеціальних програм для організації якісної і швидкої роботи юристів, відбулося широке поширення правових довідкових систем. Їх тепер нараховують більше сотні, приміром Ліга Закон.
                        </li>

                        <li>
                            <span className="mini-logo">Менеджменту</span>
                            За допомогою прикладних інформаційних систем збирають і впорядковують дані програмних систем, які забезпечують вироблення рішень на основі автоматизації бізнес-процесів у сфері керування, інформаційні системи менеджменту сприяють більшій оперативності та конкретності менеджерської діяльності, забезпечують своєчасність усіх управлінських розрахунків, контроль за виконанням управлінських рішень і зворотній зв’язок, удосконалення менеджерської діяльності підприємств та підвищення на цій основі ефективності їх роботи.
                        </li>

                        <li>
                            <span className="mini-logo">Дизайну</span>
                            Ця предметна сфера використовує різні графічні програми і редактори, що є частиною інформаційної культури, полегшуючи роботу дизайнерів, сприяючи появі інновацій і нових напрямків стилю у дизайні третього тисячоліття.
                        </li>

                        <li>
                            <span className="mini-logo">Туризму</span>
                            Ця індустрія пристосована для впровадження сучасних інформаційних технологій, тому зазнала значного впливу науково-технічного прогресу. Охоплює інформаційні системи менеджменту, глобальні системи бронювання, мультимедіа, інтегровані комунікаційні мережі для забезпечення діяльності туризму тощо.
                        </li>

                        <li>
                            <span className="mini-logo">Медицини</span>
                            Новітні інформаційні технології все більше використовують у галузі охорони здоров’я, що буває зручним, а часом просто необхідним. Завдяки цьому медицина, в тому числі і нетрадиційна, набуває сьогодні абсолютно нових рис. У багатьох медичних дослідженнях обов’язково використовують комп’ютер і прикладне програмне забезпечення. Цей процес супроводжують суттєвими змінами в медичній теорії та практиці, що пов’язані з внесенням коректив, як на етапі підготовки медичних працівників, так і для медичної практики.
                        </li>

                        <li>
                            <span className="mini-logo">Освіти</span>
                            Процес навчання, особливо дистанційного, обов’язково використовує прикладне програмне забезпечення. В освіті інформатизація відкриває доступ до світових інформаційних ресурсів; зменшує залежність викладання і навчання від місцезнаходження учасників процесу та часових рамок; сприяє вдосконаленню форм і змісту навчального процесу, підвищенню ефективності засвоєння навчального матеріалу та персоніфікації навчання, інтеграції навчальної, дослідницької та виробничої діяльності; значно збільшує обсяги ресурсів, якими студенти можуть користуватися за межами аудиторії; сприяє підвищенню мотивації до навчання та розвитку креативного мислення. Інтерактивність і мультимедійна наочність сприяють кращому поданню і засвоєнню інформації.
                        </li>
                    </ul>
                </div>


                <h2>
                    <span className='underline'>
                        Теми Дипломних Робiт
                    </span>
                </h2>

                <div className="content-box">
                    <h3>Можливі теми дипломних студентських робіт</h3>
                    <p className={`load`} onClick={()=>{
                        this.download(dip_src);
                    }}>Жми тут для загрузки файла!</p>
                </div>


                <h2>
                    <span className='underline'>
                        Стандарт
                    </span>
                </h2>

                <div className="content-box">
                    <h3>Завантажити стандарт зі спеціальності</h3>
                    <p>Кафедра прикладних інформаційних систем здійснює навчання студентів за програмою «Прикладні інформаційні системи» спеціальності 122 «Комп’ютерні науки та інформаційні технології» галузі знань 12 «Інформаційні технології».</p>
                    <p> Фахівці з прикладних інформаційних систем орієнтовані на використання новітніх інформаційно-комунікаційних технологій для прийняття управлінських рішень у різних прикладних сферах і галузях національної економіки.</p>
                    <p className={`load`} onClick={()=>{
                        this.download(standart_src);
                    }}>Жми тут для загрузки файла!</p>
                </div>

                <a style={{display: 'none'}} id={'download_smth'} >asd</a>

            </div>
        )
    }
}